In [3]:
import pandas as pd
import numpy as np
import os

In [4]:
os.chdir(r'C:\Users\palak\Dropbox\Python online courses')
os.getcwd()

'C:\\Users\\palak\\Dropbox\\Python online courses'

In [5]:
df = pd.read_excel('emp_info_sudeep session.xlsx')

In [6]:
df

      Name EmpID    Deptt  Passport
0   Sudeep  A342  Quality  DF453278
1  Ruchika  C578    Sales  CA567657
2      NaN  J436    Admin  DF453278
3    Arjun  A342      NaN  RF453432
4    Rishi  R475    Prodn  DF453278
5   Chetan   NaN      NaN  ER534867
6   Deepak   NaN  Quality  RF453432

In [7]:
res = np.where(df['Name'].isnull())

In [10]:
df_dep = pd.read_excel('employees_sudeep session.xlsx',sheet_name = 'dep')

In [11]:
df_dep

      Name EmpID        Deptt
0   Sudeep  A342      Quality
1  Ruchika  C578        Sales
2  Deepika  J436        Admin
3    Arjun  A342  Procurement
4    Rishi  R475        Prodn

In [12]:
df_sal = pd.read_excel('employees_sudeep session.xlsx',sheet_name = 'sal')

In [13]:
df_sal

       Name EmpID  Salary
0    Sudeep  A342      56
1   Deepika  J436      45
2    Chetan  B435      76
3  Abhishek  C234      47
4     Rishi  R475      38

In [14]:
# to merge / intersection of the two sets

df_new = pd.merge(df_dep, df_sal)

In [15]:
df_new

      Name EmpID    Deptt  Salary
0   Sudeep  A342  Quality      56
1  Deepika  J436    Admin      45
2    Rishi  R475    Prodn      38

In [16]:
df_new = pd.merge(df_dep, df_sal, how = 'outer')  # similarly for left and right join

In [17]:
df_new

       Name EmpID        Deptt  Salary
0    Sudeep  A342      Quality    56.0
1   Ruchika  C578        Sales     NaN
2   Deepika  J436        Admin    45.0
3     Arjun  A342  Procurement     NaN
4     Rishi  R475        Prodn    38.0
5    Chetan  B435          NaN    76.0
6  Abhishek  C234          NaN    47.0